; ModuleID = '1qy0s3krhxnn7fkb'
source_filename = "1qy0s3krhxnn7fkb"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [6 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }

@vtable.0 = private unnamed_addr constant <{ i8*, [16 x i8], i8*, i8*, i8*, [0 x i8] }> <{ i8* bitcast (void (i64**)* @"_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h915f7ee027681576E" to i8*), [16 x i8] c"\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", i8* bitcast (i32 (i64**)* @"_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h05d87b071da08e66E" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17haf3fc2bcbbcd6de5E" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17haf3fc2bcbbcd6de5E" to i8*), [0 x i8] zeroinitializer }>, align 8, !dbg !0
@alloc33 = private unnamed_addr constant <{ [12 x i8] }> <{ [12 x i8] c"invalid args" }>, align 1

!56 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h95c4eabd28917cccE", scope: !58, file: !57, line: 140, type: !59, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !70, retainedNodes: !64)
!57 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "3344817d984839ceeae3ee45e439b0f7")
!58 = !DINamespace(name: "rt", scope: !36)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !39, !61, !62}
!61 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !63, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !{!65, !66, !67, !68}
!65 = !DILocalVariable(name: "main", arg: 1, scope: !56, file: !57, line: 141, type: !39)
!66 = !DILocalVariable(name: "argc", arg: 2, scope: !56, file: !57, line: 142, type: !61)
!67 = !DILocalVariable(name: "argv", arg: 3, scope: !56, file: !57, line: 143, type: !62)
!68 = !DILocalVariable(name: "v", scope: !69, file: !57, line: 145, type: !61, align: 8)
!69 = distinct !DILexicalBlock(scope: !56, file: !57, line: 145, column: 5)
!70 = !{!48}
!71 = !DILocation(line: 141, column: 5, scope: !56)
!72 = !DILocation(line: 142, column: 5, scope: !56)
!73 = !DILocation(line: 143, column: 5, scope: !56)
!74 = !DILocation(line: 146, column: 10, scope: !56)
!75 = !DILocation(line: 146, column: 9, scope: !56)
!76 = !DILocation(line: 145, column: 17, scope: !56)
!77 = !DILocation(line: 145, column: 12, scope: !56)
!78 = !DILocation(line: 145, column: 12, scope: !69)
!79 = !DILocation(line: 151, column: 2, scope: !56)
!80 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17haf3fc2bcbbcd6de5E", scope: !81, file: !57, line: 146, type: !82, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !70, retainedNodes: !90)
!81 = !DINamespace(name: "lang_start", scope: !58)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !85}
!84 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&{closure#0}", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure#0}", scope: !81, file: !2, size: 64, align: 64, elements: !87, templateParams: !89, identifier: "1330994e0371cc0f4656eff82c025d81")
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !86, file: !2, baseType: !39, size: 64, align: 64)
!89 = !{}
!90 = !{!91}
!91 = !DILocalVariable(name: "main", scope: !80, file: !57, line: 141, type: !39, align: 8)
!92 = !DILocation(line: 141, column: 5, scope: !80)
!93 = !DILocation(line: 146, column: 77, scope: !80)
!94 = !DILocation(line: 146, column: 18, scope: !80)
!95 = !DILocation(line: 146, column: 91, scope: !80)
!96 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217hb58bd3de589f5a9bE", scope: !98, file: !97, line: 474, type: !105, scopeLine: 474, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !89, retainedNodes: !108)
!97 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfab9a537a845e5d2a97a9ac6ebb2d63")
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !99, file: !2, size: 8, align: 8, elements: !103, templateParams: !89, identifier: "b09e20bc84f4e3025c0a6f5ebe00c57d")
!99 = !DINamespace(name: "process_common", scope: !100)
!100 = !DINamespace(name: "process", scope: !101)
!101 = !DINamespace(name: "unix", scope: !102)
!102 = !DINamespace(name: "sys", scope: !36)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !98, file: !2, baseType: !20, size: 8, align: 8)
!105 = !DISubroutineType(types: !106)
!106 = !{!84, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&ExitCode", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !{!109}
!109 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !97, line: 474, type: !107)
!110 = !DILocation(line: 474, column: 19, scope: !96)
!111 = !DILocation(line: 475, column: 9, scope: !96)
!112 = !DILocation(line: 476, column: 6, scope: !96)
!113 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h3c95ffd7d6febbd6E", scope: !115, file: !114, line: 361, type: !222, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !89, retainedNodes: !224)
!114 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8e7ebdafdaa535d03fe8490be5d0b5ea")
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !18, file: !2, size: 384, align: 64, elements: !116, templateParams: !89, identifier: "a360e155a516935c2edb707fb484e50b")
!116 = !{!117, !128, !177}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !115, file: !2, baseType: !118, size: 128, align: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !119, templateParams: !89, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!119 = !{!120, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !118, file: !2, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !123, templateParams: !89, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !122, file: !2, baseType: !63, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !122, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !115, file: !2, baseType: !129, size: 128, align: 64, offset: 128)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !130, file: !2, size: 128, align: 64, elements: !131, identifier: "5f76414d3968d7081799a90ac22875bd")
!130 = !DINamespace(name: "option", scope: !19)
!131 = !{!132}
!132 = !DICompositeType(tag: DW_TAG_variant_part, scope: !130, file: !2, size: 128, align: 64, elements: !133, templateParams: !136, identifier: "5f76414d3968d7081799a90ac22875bd_variant_part", discriminator: !176)
!133 = !{!134, !172}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !132, file: !2, baseType: !135, size: 128, align: 64, extraData: i64 0)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !129, file: !2, size: 128, align: 64, elements: !89, templateParams: !136, identifier: "5f76414d3968d7081799a90ac22875bd::None")
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "T", type: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !139, templateParams: !89, identifier: "add0e6342cb63c6fd291c94d3505b91c")
!139 = !{!140, !171}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const Argument", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !16, file: !2, size: 448, align: 64, elements: !143, templateParams: !89, identifier: "763ee80a35beebf8b514d3c418f0e312")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !142, file: !2, baseType: !126, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !142, file: !2, baseType: !146, size: 384, align: 64, offset: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !16, file: !2, size: 384, align: 64, elements: !147, templateParams: !89, identifier: "bc399e583737a2b0aabdd4d017584f65")
!147 = !{!148, !150, !151, !153, !170}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !146, file: !2, baseType: !149, size: 32, align: 32, offset: 256)
!149 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !146, file: !2, baseType: !15, size: 8, align: 8, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !2, baseType: !152, size: 32, align: 32, offset: 288)
!152 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !146, file: !2, baseType: !154, size: 128, align: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !16, file: !2, size: 128, align: 64, elements: !155, identifier: "38eba57020d20ab810366aace8807a13")
!155 = !{!156}
!156 = !DICompositeType(tag: DW_TAG_variant_part, scope: !16, file: !2, size: 128, align: 64, elements: !157, templateParams: !89, identifier: "38eba57020d20ab810366aace8807a13_variant_part", discriminator: !168)
!157 = !{!158, !162, !166}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !156, file: !2, baseType: !159, size: 128, align: 64, extraData: i64 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !154, file: !2, size: 128, align: 64, elements: !160, templateParams: !89, identifier: "38eba57020d20ab810366aace8807a13::Is")
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !159, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !156, file: !2, baseType: !163, size: 128, align: 64, extraData: i64 1)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !154, file: !2, size: 128, align: 64, elements: !164, templateParams: !89, identifier: "38eba57020d20ab810366aace8807a13::Param")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !163, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !156, file: !2, baseType: !167, size: 128, align: 64, extraData: i64 2)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !154, file: !2, size: 128, align: 64, elements: !89, templateParams: !89, identifier: "38eba57020d20ab810366aace8807a13::Implied")
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !2, baseType: !169, size: 64, align: 64, flags: DIFlagArtificial)
!169 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !146, file: !2, baseType: !154, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !138, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !132, file: !2, baseType: !173, size: 128, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !129, file: !2, size: 128, align: 64, elements: !174, templateParams: !136, identifier: "5f76414d3968d7081799a90ac22875bd::Some")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !173, file: !2, baseType: !138, size: 128, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !2, baseType: !169, size: 64, align: 64, flags: DIFlagArtificial)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !115, file: !2, baseType: !178, size: 128, align: 64, offset: 256)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !179, templateParams: !89, identifier: "ad7c8b03f48c0dcf73f319360577f3d5")
!179 = !{!180, !221}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !2, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ArgumentV1", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !18, file: !2, size: 128, align: 64, elements: !183, templateParams: !89, identifier: "c7ce43acbe4b6205b3d5abdc2e2d3e77")
!183 = !{!184, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !2, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&Opaque", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !89, identifier: "db2cc22363e1d99b3a086e242402e769")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !182, file: !2, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !189, size: 64, align: 64, dwarfAddressSpace: 0)
!189 = !DISubroutineType(types: !190)
!190 = !{!26, !185, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut Formatter", baseType: !192, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !18, file: !2, size: 512, align: 64, elements: !193, templateParams: !89, identifier: "90d9c21992f1292241ad45c3955c5499")
!193 = !{!194, !195, !196, !197, !210, !211}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !2, baseType: !152, size: 32, align: 32, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !192, file: !2, baseType: !149, size: 32, align: 32, offset: 416)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !192, file: !2, baseType: !15, size: 8, align: 8, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !192, file: !2, baseType: !198, size: 128, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !130, file: !2, size: 128, align: 64, elements: !199, identifier: "4b805254fa2ee3ca2df3072d2fabafc2")
!199 = !{!200}
!200 = !DICompositeType(tag: DW_TAG_variant_part, scope: !130, file: !2, size: 128, align: 64, elements: !201, templateParams: !204, identifier: "4b805254fa2ee3ca2df3072d2fabafc2_variant_part", discriminator: !176)
!201 = !{!202, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !200, file: !2, baseType: !203, size: 128, align: 64, extraData: i64 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !198, file: !2, size: 128, align: 64, elements: !89, templateParams: !204, identifier: "4b805254fa2ee3ca2df3072d2fabafc2::None")
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !126)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !200, file: !2, baseType: !207, size: 128, align: 64, extraData: i64 1)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !198, file: !2, size: 128, align: 64, elements: !208, templateParams: !204, identifier: "4b805254fa2ee3ca2df3072d2fabafc2::Some")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !207, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !192, file: !2, baseType: !198, size: 128, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !2, baseType: !212, size: 128, align: 64, offset: 256)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !213, templateParams: !89, identifier: "9405b243a0f4184842c4793de8cc6f20")
!213 = !{!214, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !212, file: !2, baseType: !215, size: 64, align: 64, flags: DIFlagArtificial)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !212, file: !2, baseType: !217, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !218, size: 64, align: 64, dwarfAddressSpace: 0)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 192, align: 64, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 3, lowerBound: 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !2, baseType: !126, size: 64, align: 64, offset: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!115, !118, !178}
!224 = !{!225, !226}
!225 = !DILocalVariable(name: "pieces", arg: 1, scope: !113, file: !114, line: 361, type: !118)
!226 = !DILocalVariable(name: "args", arg: 2, scope: !113, file: !114, line: 361, type: !178)
!227 = !DILocation(line: 361, column: 25, scope: !113)
!228 = !DILocation(line: 361, column: 53, scope: !113)
!229 = !DILocation(line: 362, column: 12, scope: !113)
!230 = !DILocation(line: 362, column: 56, scope: !113)
!231 = !DILocation(line: 362, column: 41, scope: !113)
!232 = !{i8 0, i8 2}
!233 = !DILocation(line: 365, column: 34, scope: !113)
!234 = !DILocation(line: 365, column: 9, scope: !113)
!235 = !DILocation(line: 366, column: 6, scope: !113)
!236 = !DILocation(line: 363, column: 13, scope: !113)
!237 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h05d87b071da08e66E", scope: !239, file: !238, line: 227, type: !242, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !248, retainedNodes: !245)
!238 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a40c014f8a7b8b7cd612b461a47e902")
!239 = !DINamespace(name: "FnOnce", scope: !240)
!240 = !DINamespace(name: "function", scope: !241)
!241 = !DINamespace(name: "ops", scope: !19)
!242 = !DISubroutineType(types: !243)
!243 = !{!84, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut {closure#0}", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!245 = !{!246, !247}
!246 = !DILocalVariable(arg: 1, scope: !237, file: !238, line: 227, type: !244)
!247 = !DILocalVariable(arg: 2, scope: !237, file: !238, line: 227, type: !5)
!248 = !{!249, !250}
!249 = !DITemplateTypeParameter(name: "Self", type: !86)
!250 = !DITemplateTypeParameter(name: "Args", type: !5)
!251 = !DILocation(line: 227, column: 5, scope: !237)
!252 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure#0}, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hcc7f309ae1cc237bE", scope: !239, file: !238, line: 227, type: !253, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !248, retainedNodes: !255)
!253 = !DISubroutineType(types: !254)
!254 = !{!84, !86}
!255 = !{!256, !257}
!256 = !DILocalVariable(arg: 1, scope: !252, file: !238, line: 227, type: !86)
!257 = !DILocalVariable(arg: 2, scope: !252, file: !238, line: 227, type: !5)
!258 = !DILocation(line: 227, column: 5, scope: !252)
!259 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he2ef528cca5ba070E", scope: !239, file: !238, line: 227, type: !37, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !263, retainedNodes: !260)
!260 = !{!261, !262}
!261 = !DILocalVariable(arg: 1, scope: !259, file: !238, line: 227, type: !39)
!262 = !DILocalVariable(arg: 2, scope: !259, file: !238, line: 227, type: !5)
!263 = !{!264, !250}
!264 = !DITemplateTypeParameter(name: "Self", type: !39)
!265 = !DILocation(line: 227, column: 5, scope: !259)
!266 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure#0}>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h915f7ee027681576E", scope: !268, file: !267, line: 188, type: !269, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !273, retainedNodes: !271)
